index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-06-21 Sun 17:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Canon EOS Documentation Project</title>
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Canon EOS Documentation Project</h1>
<p>
To me, there are many subtle questions about how the Canon EOS cameras
work that are not answered in the manual.  The top most of these are
all the functions that can be assigned to buttons.  Most are not
documented at all.  This project is to document those areas that need
more documentation.
</p>

<p>
The project is hosted at <a href="https://github.com/pedz/Canon-EOS-Documentation-Project">Canon-EOS-Documentation-Project</a>.  If you
would like to help, please open a discussion in the project on GitHub.
</p>

<p>
The <b>Canon EOS R1 Menu.txt</b> and <b>Canon EOS R5 Mark II Menu.txt</b> are
UTF-8 files intended to be downloaded and stored on your phone.  Then
accessed and searched for the menu that you are looking for.  It will
provide you with info on where to find it on your camera.
</p>

<ol class="org-ol">
<li><a href="Canon EOS R1 Supplement.html">Canon EOS R1 Supplement</a></li>
<li><a href="Canon EOS R1 Menu.txt">Canon EOS R1 Menu.txt</a> (right click and download)</li>
<li><a href="Canon EOS R5 Mark II Supplement.html">Canon EOS R5 Mark II Supplement</a></li>
<li><a href="Canon EOS R5 Mark II Menu.txt">Canon EOS R5 Mark II Menu.txt</a> (right click and download)</li>
</ol>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2026-06-21 Sun 17:48</p>
</div>
</body>
</html>
